# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
nums_series1 = pd.Series(np.random.randint(1, high=5, size=100))
nums_series2 = pd.Series(np.random.randint(1, high=4, size=100))
nums_series3 = pd.Series(np.random.randint(10000, high=30001, size=100))

print(nums_series1, nums_series2, nums_series3)

0     3
1     3
2     2
3     1
4     1
     ..
95    4
96    2
97    4
98    4
99    2
Length: 100, dtype: int64 0     1
1     2
2     3
3     3
4     1
     ..
95    2
96    3
97    2
98    1
99    2
Length: 100, dtype: int64 0     10667
1     21856
2     16906
3     13494
4     10254
      ...
95    12321
96    22313
97    28225
98    16823
99    20376
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [7]:
df = pd.concat([nums_series1, nums_series2, nums_series3], axis=1)
df

    0  1      2
0   3  1  10667
1   3  2  21856
2   2  3  16906
3   1  3  13494
4   1  1  10254
.. .. ..    ...
95  4  2  12321
96  2  3  22313
97  4  2  28225
98  4  1  16823
99  2  2  20376

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            10667
1       3       2            21856
2       2       3            16906
3       1       3            13494
4       1       1            10254
..    ...     ...              ...
95      4       2            12321
96      2       3            22313
97      4       2            28225
98      4       1            16823
99      2       2            20376

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolumn = pd.concat([nums_series1, nums_series2, nums_series3])

bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       3
2       2
3       1
4       1
..    ...
95  12321
96  22313
97  28225
98  16823
99  20376

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [17]:
bigcolumn.tail()

95    12321
96    22313
97    28225
98    16823
99    20376
dtype: int64

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [28]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail(10)

         0
290  22070
291  12364
292  15111
293  18658
294  24614
295  12321
296  22313
297  28225
298  16823
299  20376